In [5]:
import pandas as pd
import numpy as np

# Intro to pandas

## Type of data to read: excel, csv, json, sql

In [ ]:
# EXCEL 
df = pd.read_excel('file_path.xlsx')

# CSV 
df = pd.read_csv('file_path.csv')

# JSON
df = pd.read_json('file_path.json')

## Pandas read exploring: .head(), .info(), .describe()

In [6]:
import pandas as pd

data = {
    'Car Name': ['Toyota Corolla', 'Honda Civic', 'Ford Mustang', 'Chevrolet Camaro', 'Tesla Model 3', 'BMW X5', 'Audi A4'],
    'Price': [25000, 22000, 35000, 40000, 50000, 60000, 30000],
    'Is Broken': [False, True, True, False, True, False, False]
}

df_cars = pd.DataFrame(data)

In [7]:
df_cars.head()

           Car Name  Price  Is Broken
0    Toyota Corolla  25000      False
1       Honda Civic  22000       True
2      Ford Mustang  35000       True
3  Chevrolet Camaro  40000      False
4     Tesla Model 3  50000       True

In [8]:
df_cars.head(n=3)

         Car Name  Price  Is Broken
0  Toyota Corolla  25000      False
1     Honda Civic  22000       True
2    Ford Mustang  35000       True

In [9]:
df_cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Car Name   7 non-null      object
 1   Price      7 non-null      int64
 2   Is Broken  7 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 251.0+ bytes

In [10]:
df_cars.describe()

              Price
count      7.000000
mean   37428.571429
std    13709.572603
min    22000.000000
25%    27500.000000
50%    35000.000000
75%    45000.000000
max    60000.000000

# Series

In [11]:
# From lists
ages_list = [21, 20, 25, 22]
names_list = ['Anna', 'Bob', 'Maria', 'Jack']

ages_series = pd.Series(data=ages_list, index=names_list, name='Age')
print(ages_series)

Anna     21
Bob      20
Maria    25
Jack     22
Name: Age, dtype: int64

In [22]:
# From dict
student_ages_dict = {'Anna': 21, 'Bob': 20, 'Maria': 25, 'Jack': 22}

ages_series = pd.Series(student_ages_dict, name='Ages')
print(ages_series)

Anna     21
Bob      20
Maria    25
Jack     22
Name: Ages, dtype: int64

In [13]:
# Change the index 
ages_series.index = ['A', 'B', 'M', 'J']
print(ages_series)

A    21
B    20
M    25
J    22
Name: Ages, dtype: int64

In [14]:
# Series are value-mutable
# Change the value from the index
ages_series['Jack'] = 23
print(ages_series)

A       21
B       20
M       25
J       22
Jack    23
Name: Ages, dtype: int64

In [15]:
ages_series.iloc[0] = 25
print(ages_series)

A       25
B       20
M       25
J       22
Jack    23
Name: Ages, dtype: int64

In [23]:
# Series are size immutable: once it's created, no elements 
# can be added ro removed from it without creating a new object
new_age_series = ages_series.drop(index='Maria')
print(ages_series, "\n")
print(new_age_series)  # Keeps unchanges

Anna     21
Bob      20
Maria    25
Jack     22
Name: Ages, dtype: int64

Anna    21
Bob     20
Jack    22
Name: Ages, dtype: int64

In [24]:
# Asing/remove new value from the original uses the parameter: inplace=True
ages_series.drop(index="Jack", inplace=True)
print(ages_series)

Anna     21
Bob      20
Maria    25
Name: Ages, dtype: int64

In [25]:
ages_series["Jack"] = 30
print(ages_series)

Anna     21
Bob      20
Maria    25
Jack     30
Name: Ages, dtype: int64

In [26]:
new_recs = pd.Series({'Jon': 34, 'Peter': 23, 'Karo': 45, 'Abby': 25})
ages_series = pd.concat([ages_series, new_recs])
print(ages_series)

Anna     21
Bob      20
Maria    25
Jack     30
Jon      34
Peter    23
Karo     45
Abby     25
dtype: int64

# DataFrame

In [27]:
students_list = [['Anna', 'Smith', 21],
                 ['Bob', 'Jones', 20],
                 ['Maria', 'Williams', 25],
                 ['Jack', 'Brown', 22]]

In [28]:
students = pd.DataFrame(data=students_list, columns=['First Name', 'Family Name', 'Age'])
students

  First Name Family Name  Age
0       Anna       Smith   21
1        Bob       Jones   20
2      Maria    Williams   25
3       Jack       Brown   22

In [29]:
students_number = [100, 200, 300, 400]
students = pd.DataFrame(students_list, 
                        columns = ['First Name', 'Family Name', 'Age'],
                        index = students_number)
students

    First Name Family Name  Age
100       Anna       Smith   21
200        Bob       Jones   20
300      Maria    Williams   25
400       Jack       Brown   22

In [30]:
# Datafram from a nested dict: 
# This is a nested dictionary representing the students table
students_dict = {'First Name': {100: 'Anna', 
                                200: 'Bob', 
                                300: 'Maria',
                                400: 'Jack'},
                 
                 'Family Name': {100: 'Smith', 
                                 200: 'Jones',
                                 300: 'Williams',
                                 400: 'Brown'},
                 'Age': {100: 21, 
                         200: 20, 
                         300: 25,
                         400: 22}}

students = pd.DataFrame(students_dict)
students

    First Name Family Name  Age
100       Anna       Smith   21
200        Bob       Jones   20
300      Maria    Williams   25
400       Jack       Brown   22

In [31]:
students.shape

(4, 3)

In [32]:
students.head()

    First Name Family Name  Age
100       Anna       Smith   21
200        Bob       Jones   20
300      Maria    Williams   25
400       Jack       Brown   22

In [33]:
students[['First Name', 'Age']]

    First Name  Age
100       Anna   21
200        Bob   20
300      Maria   25
400       Jack   22

In [34]:
students['Age']

100    21
200    20
300    25
400    22
Name: Age, dtype: int64

In [35]:
type(students['Age'])

pandas.core.series.Series

In [36]:
students['Age'].to_numpy()

array([21, 20, 25, 22])

In [37]:
students[['Age', 'First Name']].to_numpy()

array([[21, 'Anna'],
       [20, 'Bob'],
       [25, 'Maria'],
       [22, 'Jack']], dtype=object)

In [38]:
students.head()

    First Name Family Name  Age
100       Anna       Smith   21
200        Bob       Jones   20
300      Maria    Williams   25
400       Jack       Brown   22

In [39]:
students.tail(n=2)

    First Name Family Name  Age
300      Maria    Williams   25
400       Jack       Brown   22

In [40]:
# Saving DataFrame to a file
students.to_csv('data/student_names.csv', sep='\t', columns = ['First Name', 'Family Name'], index=True)

# Accessing data in a DF

In [62]:
pets = {
    'species': ['cat', 'dog', 'parrot', 'cockroach'], 
    'name': ['Dr. Mittens Lamar', 'Diesel', 'Peach', 'Richard'], 
    'legs': [4, 4, 2, 6],
    'wings': [0, 0, 2, 4],
    'looking_for_home': ['no', 'no', 'no', 'yes']
}
df = pd.DataFrame(pets)
df.head()

     species               name  legs  wings looking_for_home
0        cat  Dr. Mittens Lamar     4      0               no
1        dog             Diesel     4      0               no
2     parrot              Peach     2      2               no
3  cockroach            Richard     6      4              yes

In [42]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['species', 'name', 'legs', 'wings', 'looking_for_home'], dtype='object')]

In [43]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.axes[0]

RangeIndex(start=0, stop=4, step=1)

In [45]:
df.columns

Index(['species', 'name', 'legs', 'wings', 'looking_for_home'], dtype='object')

In [46]:
df.axes[1]

Index(['species', 'name', 'legs', 'wings', 'looking_for_home'], dtype='object')

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   species           4 non-null      object
 1   name              4 non-null      object
 2   legs              4 non-null      int64
 3   wings             4 non-null      int64
 4   looking_for_home  4 non-null      object
dtypes: int64(2), object(3)
memory usage: 292.0+ bytes

In [48]:
# Columns and index can be changed
df.columns = ['col', 'col2', 'col3', 'col4',  'col5']
df.head()

         col               col2  col3  col4 col5
0        cat  Dr. Mittens Lamar     4     0   no
1        dog             Diesel     4     0   no
2     parrot              Peach     2     2   no
3  cockroach            Richard     6     4  yes

In [49]:
df.index = ['row', 'row2', 'row3', 'row4']
df.head()

            col               col2  col3  col4 col5
row         cat  Dr. Mittens Lamar     4     0   no
row2        dog             Diesel     4     0   no
row3     parrot              Peach     2     2   no
row4  cockroach            Richard     6     4  yes

In [53]:
df.set_index('name', inplace=True)
df.head()

                     species  legs  wings looking_for_home
name
Dr. Mittens Lamar        cat     4      0               no
Diesel                   dog     4      0               no
Peach                 parrot     2      2               no
Richard            cockroach     6      4              yes

In [54]:
df.reset_index(inplace=True)
df.head()

                name    species  legs  wings looking_for_home
0  Dr. Mittens Lamar        cat     4      0               no
1             Diesel        dog     4      0               no
2              Peach     parrot     2      2               no
3            Richard  cockroach     6      4              yes

In [63]:
# Renaming columns
df.rename(columns={'name': 'pet_name', 'looking_for_home': 'homeless'}, inplace=True)
df.head()

     species           pet_name  legs  wings homeless
0        cat  Dr. Mittens Lamar     4      0       no
1        dog             Diesel     4      0       no
2     parrot              Peach     2      2       no
3  cockroach            Richard     6      4      yes

In [64]:
df.drop(columns='legs', inplace=True)
df.head()

     species           pet_name  wings homeless
0        cat  Dr. Mittens Lamar      0       no
1        dog             Diesel      0       no
2     parrot              Peach      2       no
3  cockroach            Richard      4      yes

In [68]:
df.index = [4, 5, 6, 7]
df.head()

     species           pet_name  wings homeless
4        cat  Dr. Mittens Lamar      0       no
5        dog             Diesel      0       no
6     parrot              Peach      2       no
7  cockroach            Richard      4      yes

In [69]:
df.reset_index(drop=True, inplace=True)
df.head()

     species           pet_name  wings homeless
0        cat  Dr. Mittens Lamar      0       no
1        dog             Diesel      0       no
2     parrot              Peach      2       no
3  cockroach            Richard      4      yes

# Missing values

In [94]:
df = pd.read_csv('data/student-por.csv')

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 649 entries, 0 to 648
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      649 non-null    object
 1   sex         649 non-null    object
 2   age         649 non-null    int64
 3   address     649 non-null    object
 4   famsize     649 non-null    object
 5   Pstatus     649 non-null    object
 6   Medu        649 non-null    int64
 7   Fedu        649 non-null    int64
 8   Mjob        649 non-null    object
 9   Fjob        649 non-null    object
 10  reason      649 non-null    object
 11  guardian    649 non-null    object
 12  traveltime  649 non-null    int64
 13  studytime   649 non-null    int64
 14  failures    649 non-null    int64
 15  schoolsup   649 non-null    object
 16  famsup      649 non-null    object
 17  paid        649 non-null    object
 18  activities  649 non-null    object
 19  nursery     649 non-null    object
 20  higher      649 non-null    object
 21  internet    649 non-null    object
 22  romantic    649 non-null    object
 23  famrel      649 non-null    int64
 24  freetime    649 non-null    int64
 25  goout       649 non-null    int64
 26  Dalc        649 non-null    int64
 27  Walc        649 non-null    int64
 28  health      649 non-null    int64
 29  absences    649 non-null    int64
 30  G1          649 non-null    int64
 31  G2          649 non-null    int64
 32  G3          649 non-null    int64
dtypes: int64(16), object(17)
memory usage: 167.4+ KB

In [96]:
df.isnull().sum()

school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
G3            0
dtype: int64

## Excercise

In [105]:
df = pd.read_csv("data/ex_dataset.txt")

In [106]:
df.head()

   year degree  age
0   2.0      M   22
1   1.0      M   27
2   3.0      M   20
3   1.0    NaN   22
4   NaN      M   22

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    11 non-null     float64
 1   degree  10 non-null     object
 2   age     15 non-null     int64
dtypes: float64(1), int64(1), object(1)
memory usage: 492.0+ bytes

In [108]:
df.isnull().any().sum()

np.int64(2)

In [109]:
df.isnull().sum()

year      4
degree    5
age       0
dtype: int64